; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v6 ?v5)
		(pred_2 ?v8)
		(pred_3 ?v2)
		(pred_5 ?v2)
		(pred_4 ?v8 ?v2)
		(pred_1)
		(pred_6 ?v8))

   (:action op_1
       :parameters  (?v4 ?v7)
       :precondition (and (not-eq ?v4 ?v7) 
                          (pred_3 ?v4) (pred_3 ?v7) (pred_5 ?v4))
       :effect (and  (pred_5 ?v7)
		     (not (pred_5 ?v4))))


   (:action op_3
       :parameters (?v1 ?v3)
       :precondition  (and  (pred_2 ?v1) (pred_3 ?v3)
			    (pred_4 ?v1 ?v3) (pred_5 ?v3) (pred_1))
       :effect (and (pred_6 ?v1)
		    (not (pred_4 ?v1 ?v3)) 
		    (not (pred_1))))

   (:action op_2
       :parameters  (?v1  ?v3)
       :precondition  (and  (pred_2 ?v1) (pred_3 ?v3)
			    (pred_6 ?v1) (pred_5 ?v3))
       :effect (and (pred_4 ?v1 ?v3)
		    (pred_1)
		    (not (pred_6 ?v1)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_06 obj_04 obj_03 
          obj_02 obj_01 obj_05 
)
(:init
(pred_3 obj_06)
(pred_3 obj_04)
(pred_3 obj_03)
(pred_2 obj_02)
(pred_2 obj_01)
(pred_2 obj_05)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_04)
(pred_1)
(pred_4 obj_02 obj_06)
(pred_4 obj_01 obj_03)
(pred_4 obj_05 obj_03)
(pred_5 obj_06)
)
(:goal
(and
(pred_4 obj_02 obj_06)
(pred_4 obj_01 obj_04)
(pred_4 obj_05 obj_06)
)
)

(:constraints
  (and
    (sometime-before  (pred_4 obj_01 obj_04) (pred_5 obj_06))
    (sometime-before  (pred_4 obj_05 obj_06) (pred_5 obj_04))
  )
)
)

; plan
1. (op_1 obj_06 obj_03)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_03)
   goals met: 1 of 3
2. (op_3 obj_01 obj_03)
   deleted: (pred_4 obj_01 obj_03) (pred_1)
   added: (pred_6 obj_01)
   goals met: 1 of 3
3. (op_1 obj_03 obj_04)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_04)
   goals met: 1 of 3
4. (op_2 obj_01 obj_04)
   deleted: (pred_6 obj_01)
   added: (pred_4 obj_01 obj_04) (pred_1)
   goals met: 2 of 3
5. (op_1 obj_04 obj_03)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_03)
   goals met: 2 of 3
6. (op_3 obj_05 obj_03)
   deleted: (pred_4 obj_05 obj_03) (pred_1)
   added: (pred_6 obj_05)
   goals met: 2 of 3
7. (op_1 obj_03 obj_06)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_06)
   goals met: 2 of 3
8. (op_2 obj_05 obj_06)
   deleted: (pred_6 obj_05)
   added: (pred_4 obj_05 obj_06) (pred_1)
   goals met: 3 of 3
